NextFOAM-2409/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/turbulent/1_Inlet_2_Outlet/porosityBased/linear/uniformity-losses/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
    (0 0      0)     //0
    (0 0.3    0)     //1
    (0 0.5    0)     //2 
    (0 0.55   0)     //3
    (0 0.75   0)     //4
    (0 1      0)     //5
    (0.5 0    0)     //6
    (0.5 0.3  0)     //7
    (0.5 0.5  0)     //8
    (0.5 0.55 0)     //9
    (0.5 0.75 0)     //10
    (0.5 1    0)     //11
    (0.7 0    0)     //12
    (0.7 0.3  0)     //13
    (0.7 0.5  0)     //14
    (0.7 0.55 0)     //15
    (0.7 0.75 0)     //16
    (0.7 1    0)     //17
    (1   0    0)     //18
    (1   0.3  0)     //19
    (1   0.5  0)     //20
    (1   0.55 0)     //21
    (1   0.75 0)     //22
    (1   1    0)     //23
    (0 0      0.1)   //24
    (0 0.3    0.1)   //25
    (0 0.5    0.1)   //26
    (0 0.55   0.1)   //27
    (0 0.75   0.1)   //28
    (0 1      0.1)   //29
    (0.5 0    0.1)   //30 
    (0.5 0.3  0.1)   //31
    (0.5 0.5  0.1)   //32
    (0.5 0.55 0.1)   //33
    (0.5 0.75 0.1)   //34
    (0.5 1    0.1)   //35
    (0.7 0    0.1)   //36
    (0.7 0.3  0.1)   //37
    (0.7 0.5  0.1)   //38
    (0.7 0.55 0.1)   //39
    (0.7 0.75 0.1)   //40
    (0.7 1    0.1)   //41
    (1   0    0.1)   //42
    (1   0.3  0.1)   //43
    (1   0.5  0.1)   //44
    (1   0.55 0.1)   //45
    (1   0.75 0.1)   //46
    (1   1    0.1)   //47

    (-0.5 0.3 0) //48
    (-0.5 0.5 0) //49
    (-0.5 0.3 0.1) //50
    (-0.5 0.5 0.1) //51

    (0.5 -0.5 0) //52
    (0.7 -0.5 0) //53
    (0.5 -0.5 0.1) //54
    (0.7 -0.5 0.1) //55

    (1.5 0.55 0) //56
    (1.5 0.75 0) //57
    (1.5 0.55 0.1) //58
    (1.5 0.75 0.1) //59
);

blocks          
(
    hex (48 50 25 1  49 51 26 2 ) (1 50 20) simpleGrading (1 1 1)   //0
    hex (0  24 30 6  1  25 31 7 ) (1 50 30) simpleGrading (1 1 1)   //1
    hex (1  25 31 7  2  26 32 8 ) (1 50 20) simpleGrading (1 1 1)   //2
    hex (2  26 32 8  3  27 33 9 ) (1 50  5) simpleGrading (1 1 1)   //3
    hex (3  27 33 9  4  28 34 10) (1 50 20) simpleGrading (1 1 1)   //4
    hex (4  28 34 10 5  29 35 11) (1 50 25) simpleGrading (1 1 1)   //5
    hex (6  30 36 12 7  31 37 13) (1 20 30) simpleGrading (1 1 1)   //6
    hex (7  31 37 13 8  32 38 14) (1 20 20) simpleGrading (1 1 1)   //7
    hex (8  32 38 14 9  33 39 15) (1 20  5) simpleGrading (1 1 1)   //8
    hex (9  33 39 15 10 34 40 16) (1 20 20) simpleGrading (1 1 1)   //9
    hex (10 34 40 16 11 35 41 17) (1 20 25) simpleGrading (1 1 1)   //10
    hex (12 36 42 18 13 37 43 19) (1 30 30) simpleGrading (1 1 1)   //11
    hex (13 37 43 19 14 38 44 20) (1 30 20) simpleGrading (1 1 1)   //12
    hex (14 38 44 20 15 39 45 21) (1 30  5) simpleGrading (1 1 1)   //13
    hex (15 39 45 21 16 40 46 22) (1 30 20) simpleGrading (1 1 1)   //14
    hex (16 40 46 22 17 41 47 23) (1 30 25) simpleGrading (1 1 1)   //15
    hex (52 54 55 53 6  30 36 12) (1 20 50) simpleGrading (1 1 1)   //16
    hex (21 45 58 56 22 46 59 57) (1 50 20) simpleGrading (1 1 1)   //17
);

edges           
(
);

patches         
(
    wall designWall 
    (
        (1 0 24 25)
        (3 2 26 27)
        (4 3 27 28)
        (5 4 28 29)
        (11 5 29 35)
        (17 11 35 41)
        (23 17 41 47)
        (22 23 47 46)
        (20 21 45 44)
        (19 20 44 43)
        (18 19 43 42)
        (0 6 30 24)
        (12 18 42 36)
    )

    wall IEntranceWall 
    (
        (48 1  25 50)
        (51 26 2  49)
    )

    wall OEntranceWall 
    (
        (6 52 54 30)
        (12 36 55 53)
    )

    wall OREntranceWall 
    (
        (22 46 59 57)
        (21 56 58 45)
    )

    patch inlet
    (
        (49 48 50 51)
    )
    patch outlet
    (
        (52 53 55 54)
    )
    patch outlet-right
    (
        (56 57 59 58)
    )
    empty frontBack 
    (
        (51 50 25 26)
        (49 2  1  48)

        (30 54 55 36)
        (6 12 53 52)
        (46 45 58 59)
        (22 57 56 21)

        (0  1  7   6)
        (1  2  8   7)
        (2  3  9   8)
        (3  4  10  9)
        (4  5  11 10)
        (6  7  13 12)
        (7  8  14 13)
        (8  9  15 14)
        (9  10 16 15)
        (10 11 17 16)
        (12 13 19 18)
        (13 14 20 19)
        (14 15 21 20)
        (15 16 22 21)
        (16 17 23 22)

        (24 30 31 25)
        (25 31 32 26)
        (26 32 33 27)
        (27 33 34 28)
        (28 34 35 29)
        (30 36 37 31)
        (31 37 38 32)
        (32 38 39 33)
        (33 39 40 34)
        (34 40 41 35)
        (36 42 43 37)
        (37 43 44 38)
        (38 44 45 39)
        (39 45 46 40)
        (40 46 47 41)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
